from math import log

P = [66.5,49.3,64.5,44.2]
總能量 = 61805.9086503
P1 = [30.8,21.6,32.8,22.6]
total = 0
pr =20
總能量平方=總能量 ** 2
結果 = 0
Pn = 0
四根能量平方 =0
四根能量和= 0
def 能量算低逼(能量):
    #print("驗算",20*log(61515/20,10))
    return 20*log(能量/20,10)

for i in range(len(P)):
    Pn = pr*pow(10,P[i]/20)#20*10^(P_i/20) u Pa
    final  = 總能量 ** 2 -pow(Pn,2)
    total = total+pow(Pn,2)
    結果 = 總能量平方-pow(Pn,2)
    四根能量和 = 四根能量和 + Pn
    四根能量平方= 四根能量平方+pow(Pn,2)


print(pow(total,0.5))
print("結果",結果 ** 0.5)
print("四根能量平方 " , 四根能量平方 ** 0.5)
print(能量算低逼(總能量平方 ** 0.5))
print((總能量平方-四根能量平方)** 0.5)
print(能量算低逼((總能量平方 -四根能量平方) ** 0.5  ))
print((四根能量平方 ** 0.5)/ (總能量) )
print(四根能量和,四根能量平方 ** 0.5)